{% flt_var gen 'Леванин Андрей Николаевич' %}
{% flt_var gen 'Адрес: г.Лысьва, Пермский край' %}
{% flt_var gen 'Переезд: г.Пермь' %}
{% flt_var gen 'Телефон: 914-86-539-76' %}
{% flt_var gen 'E-mail: lan720@mail.ru' %}
{% flt_var gen 'Год рождения: 1976' %}
{% flt_var gen 'Семейное положение: холост' %}
{% flt_var gen 'Контактные данные:?' %}
{% flt_var gen 'Цель: Получить должность программиста с окладом не менее 35000 руб.' %}

{% flt_block skills %}Навыки и опыт:

{% flt_var db,dev '- Администрирование, проектирование БД на основе СУБД Oracle 9i-11g, MS SQL Server 97-2012; разработка программных компонентов БД на PL/SQL и Transact-SQL; глубокое знание Oracle SQL,PL/SQL' %}
{% flt_var db,dev '- Обширный опыт реверс-инжиниринга и тех.поддержки программных продуктов, использующих Oracle, MSSQL, MySQL;' %}
{% flt_var db,dev '- Разработка и сопровождение приложений баз данных, перенос баз данных на другую платформу.' %}
{% flt_var db,dev '- Разработка интерфейсов для взаимодействия биллинговой платформы с различными источниками данных (тарификация,платежи).' %}
{% flt_var adm '- Разработка скриптов для административной поддержки серверов.' %}
{% flt_var adm '- Конфигурирование системы мониторинга серверов Nagios.' %}
{% flt_var java,dev '- Разработка пользовательских приложений на Java, C++, веб-приложений на Java с использованием Spring, PrimeFaces, Apache HTTP Server, Tomcat' %}
{% flt_var adm '- Администрирование сервера Windows Terminal Services' %}
{% flt_var voice,adm '- Сопровождение и развитие колл-центра на платформе Cisco IPCC.' %}
{% flt_var voice,adm '- Разработка и сопровождение скриптов IVR и CVP для колл-центра, взаимодействия с биллингом.' %}
{% flt_var eng '- Владение английским: IELTS 6.0 (upper intermediate), экзамен сдан в августе 2017.' %}

{% endflt_block %}

{% flt_block gen,ach %}Достижения:
За время моей работы в (К?)компании я:
{% flt_var gen '- Вместе с несколькими программистами разработал с нуля и реализовал новое биллинговое ПО для компании на базе MS SQL Server;' %}
{% flt_var gen '- Написал инструменты для миграции данных из текстовой БД старого биллинга и мигрировал их в новую систему;' %}
{% flt_var gen '- После объединения компаний, в связи с внедрением нового биллинга, подготовил данные и участвовал в миграции, на этот раз из БД MS SQL в БД Oracle;' %}
{% flt_var gen '- Написал множество программ для автоматизации биллингового цикла компании с использованием Perl, PL/SQL;' %}
{% flt_var gen '- Создал устойчивую к сбоям систему модулей Perl для надежной реализации различных задач, например, внос данных платежей, обработка отключений дебиторов;' %}
{% flt_var gen '- Разработал решение на базе БД Oracle для поиска по данным предбиллинга, эффективно делающее выборки на больших объемах данных;' %}
{% flt_var gen '- Написал для него пользовательский интерфейс с использованием Java, JavaFX;' %}
{% flt_var gen '- Для колл-центра компании написал различные голосовые скрипты на базе CVP, ICM, а также TCL голосовых шлюзов;' %}
{% flt_var gen '- Установил и настроил систему мониторинга серверов с использованием Nagios;' %}
{% flt_var gen '- На платформе координации бизнес-процессов предприятия, базирующейся на Microsoft WFP, реализовал ряд бизнес-процессов, продающих продукты компании.' %}
{% endflt_block %}

{% flt_block gen,cmd %}
Владение программными продуктами
{% flt_var gen,cmd 'Oracle Database, SQL Server, MySQL, ERWin (2.5), BPWin (1.5), MS Visual Studio C++, C#, Eclipse, PL/SQL Developer' %}
{% flt_var gen,cmd 'SQL, Perl, Java, C++, C#, HTML, CSS, Javascript, HTML' %}
{% flt_var gen,cmd 'Tomcat' %}
{% flt_var gen,cmd 'Windows, Linux, FreeBSD, Solaris' %}
{% endflt_block %}

{% flt_block gen,edu %}
Образование: высшее

1993-1998 Северный Международный Университет г.Магадан. Факультет: «Физико-математический». Специальность: "Учитель математики и информатики".

{% endflt_block %}

{% flt_block gen,exp %}
Опыт работы

{% flt_block gen,exp %} 
  1998 — 2002: ОАО «Магадансвязьинформ»
  Инженер-программист ВЦ. Обязанности: тех.поддержка абонентов, сопровождение биллинга, разработка нового биллинга.
{% endflt_block %}

{% flt_block gen,exp %} 
  2002 — 2011: Магаданский филиал ОАО «Дальсвязь»
  Инженер-программист 1 кат. Обязанности: перевод БД старого биллинга в новый, поддержка нового биллинга. В связи со слиянием компаний еще один перевод БД биллинга, с платформы MSSQL на платформу Oracle.
  Тех.поддержка биллинга. Тех.поддержка колл-центра на платформе Cisco IPCC.
{% endflt_block %}

{% flt_block gen,exp %} 
  2011 — 2016: Магаданский филиал ОАО «Ростелеком»
  Инженер-программист 1 кат. Обязанности: Тех.поддержка биллинга. Тех.поддержка колл-центра на платформе Cisco IPCC.
{% endflt_block %}

{% flt_block gen,exp %} 
    2016 - настоящее время: Межрегиональный филиал Дальний Восток ПАО "Ростелеком"
    Ведущий инженер: Обязанности: тех. поддержка (Техноград? Старт?). 
    Разработка программных решений для внутренних пользователей, использующих указанные продукты.
{% endflt_block %}

{% endflt_block %}

{% flt_block gen,personal %}Персональная информация

?) Готов к работе в команде и индивидуально. Коммуникабелен, стрессоустойчив. Выполняю работу в срок (способен четко оценить сроки выполнения задачи).
?) Личные качества: ответственность, организованность, целеустремленность, трудолюбие, усидчивость.
Рекомендации будут предоставлены по требованию.

{% endflt_block %}


